## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.ecs_events will be created
  + resource "aws_cloudwatch_event_rule" "ecs_events" {
      + arn            = (known after apply)
      + description    = "Capture ECS events from the metrics cluster"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail = {
                  + clusterArn = [
                      + "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics",
                    ]
                }
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "metrics-staging-ecs-events"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.ecs_events will be created
  + resource "aws_cloudwatch_event_target" "ecs_events" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "metrics-staging-ecs-events"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.ecs_events will be created
  + resource "aws_cloudwatch_log_group" "ecs_events" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/ecs_events"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_iam_role.ecs_events_lambda will be created
  + resource "aws_iam_role" "ecs_events_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsEventsLambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_events_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_events_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "EcsEventsLambda"
    }

  # aws_lambda_function.ecs_events will be created
  + resource "aws_lambda_function" "ecs_events" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to write ECS events to a CloudWatch log group."
      + filename                       = "/tmp/ecs_events.py.zip"
      + function_name                  = "ecs_events"
      + handler                        = "ecs_events.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "t1GAz6jHVchz0hIz/Fn+Co6VAweAG790rRR8EoA3gNU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                       = {
          + "CostCentre" = "CovidShield"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.ecs_events will be created
  + resource "aws_lambda_permission" "ecs_events" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on cloudwatch_events.tf line 79, in resource "aws_cloudwatch_event_rule" "ecs_events":
  79:       "clusterArn" : ["${aws_ecs_cluster.in_app_metrics.arn}"]

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>